nes-lab/Butler/app/mixer/nrf52840/mixer_transport_ble.c
/***************************************************************************************************
 ***************************************************************************************************
 *
 *	Copyright (c) 2019, Networked Embedded Systems Lab, TU Dresden
 *	All rights reserved.
 *
 *	Redistribution and use in source and binary forms, with or without
 *	modification, are permitted provided that the following conditions are met:
 *		* Redistributions of source code must retain the above copyright
 *		  notice, this list of conditions and the following disclaimer.
 *		* Redistributions in binary form must reproduce the above copyright
 *		  notice, this list of conditions and the following disclaimer in the
 *		  documentation and/or other materials provided with the distribution.
 *		* Neither the name of the NES Lab or TU Dresden nor the
 *		  names of its contributors may be used to endorse or promote products
 *		  derived from this software without specific prior written permission.
 *
 *	THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 *	ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 *	WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 *	DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE FOR ANY
 *	DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 *	(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 *	LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
 *	ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *	(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 *	SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ***********************************************************************************************//**
 *
 *	@file					nrf52840/mixer_transport_ble.c
 *
 *	@brief					Mixer transport layer for Nordic nRF52840
 *
 *	@version				$Id$
 *	@date					TODO
 *
 *	@author					Carsten Herrmann
 *							Fabian Mager
 *
 ***************************************************************************************************

 	@details

	TODO

	ATTENTION: Product Specification (4413_417 v1.0) is inconsistent: In Fig. 123 FRAMESTART
	is triggered after reception of PHR while the text says that it is generated after SFD.
	We assume that it gets triggered after PHR, not SFD, for the following reasons:
	- On page 296 it says "Frames with zero length will be discarded, and the FRAMESTART
	  event will not be generated in this case." This behavior would be impossible with
	  FRAMESTART triggered before PHR.
	- Bitcounter connected to FRAMESTART (with shortcut) and BCC set to
	  (1 (PHR) + payload size + 2 (CRC) ) * 8 does not trigger BCCMATCH at the end of a valid
	  frame, without much doubt because Bitcounter starts to count after PHR, not before.

 **************************************************************************************************/
//***** Trace Settings *****************************************************************************

#include "gpi/trace.h"

// message groups for TRACE messages (used in GPI_TRACE_MSG() calls)
#define TRACE_INFO			GPI_TRACE_MSG_TYPE_INFO
#define TRACE_WARNING		GPI_TRACE_MSG_TYPE_WARNING
#define TRACE_VERBOSE		GPI_TRACE_MSG_TYPE_VERBOSE

// select active message groups, i.e., the messages to be printed (others will be dropped)
#ifndef GPI_TRACE_BASE_SELECTION
	#define GPI_TRACE_BASE_SELECTION	GPI_TRACE_LOG_STANDARD | GPI_TRACE_LOG_PROGRAM_FLOW
#endif
GPI_TRACE_CONFIG(mixer_transport, GPI_TRACE_BASE_SELECTION | GPI_TRACE_LOG_USER);

//**************************************************************************************************
//**** Includes ************************************************************************************

#include "../mixer_internal.h"
#include "../armv7-m/memxor.h"

#include "gpi/tools.h"
#include "gpi/platform.h"
#include "gpi/clocks.h"
#include "gpi/interrupts.h"
#include "gpi/olf.h"
#include GPI_PLATFORM_PATH(radio.h)

#include <nrf.h>

#include <stdio.h>
#include <inttypes.h>

//**************************************************************************************************
//***** Local Defines and Consts *******************************************************************

#if MX_VERBOSE_PROFILE
	GPI_PROFILE_SETUP("mixer_transport_ble.c", 1700, 4);
#endif

#define PROFILE_ISR(...)	PROFILE_P(0, ## __VA_ARGS__)

//**************************************************************************************************

ASSERT_CT_STATIC(IS_POWER_OF_2(FAST_HYBRID_RATIO), unefficient_FAST_HYBRID_RATIO);
//ASSERT_CT_STATIC(IS_POWER_OF_2(HYBRID_SLOW_RATIO), unefficient_HYBRID_SLOW_RATIO);

// MX_BLE_MODE_... reproduce Gpi_Radio_Mode because enum values cannot be evaluated by preprocessor
#define MX_BLE_MODE_1M			2
#define MX_BLE_MODE_2M			3
#define MX_BLE_MODE_125k		4
#define MX_BLE_MODE_500k		5

ASSERT_CT_STATIC(
	(MX_BLE_MODE_1M   == BLE_1M)   &&
	(MX_BLE_MODE_2M   == BLE_2M)   &&
	(MX_BLE_MODE_500k == BLE_500k) &&
	(MX_BLE_MODE_125k == BLE_125k) );

//**************************************************************************************************
// timing parameters

// NOTE: a drift tolerance of 300 ppm (150 ppm on each side) should be a comfortable choice
// (typical clock crystals have < 20...50 ppm at 25.C and temperature coefficient < 0.04 ppm/K)
// NOTE: MIN(2500, ...) is effective in case of very long slots (up to seconds). It reduces the
// tolerance to avoid that RX_WINDOW overflows too fast (or even immediately).
#define DRIFT_TOLERANCE				MIN(2500, MAX((MX_SLOT_LENGTH + 999) / 1000, 1))	// +/- 1000 ppm

// There can be additional sources for timing jitter that must be covered.
// One such source is unknown jitter and/or delay in the TX ramp up time. For instance, the nRF
// Product Specification (4413_417 v1.0 6.20.15.8) states TX enable time as typically 40us, but
// without any information about min. and max. values. v1.1 of the document says min = max = 40us,
// but t_READYJITTER = 0.25us, which is a contradiction. From our impression the full ramp up time
// seems 1...3us longer, so we take that into account.
#define JITTER_TOLERANCE			GPI_TICK_US_TO_HYBRID(4)

#define MAX_PROPAGATION_DELAY		GPI_TICK_US_TO_HYBRID(1)

// TODO: Add signaling delay to BLE modes (~10 bit times, see 15.4 implementation).
#if (MX_PHY_MODE == MX_BLE_MODE_1M)
	#define PACKET_AIR_TIME			GPI_TICK_US_TO_HYBRID2((1 + 4 + 2 + PHY_PAYLOAD_SIZE + 3) * 8)
	#define GRID_TO_EVENT_OFFSET	GPI_TICK_US_TO_HYBRID(5 * 8 + 0)		// preamble + address + event signaling latency
	#define RX_DMA_TIMEOUT			GPI_TICK_US_TO_FAST2((2 + PHY_PAYLOAD_SIZE + 3) * (8 + 1))	// NOTE: +1 incl. tolerance for clock drift
#elif (MX_PHY_MODE == MX_BLE_MODE_2M)
	#define PACKET_AIR_TIME			GPI_TICK_US_TO_HYBRID2((2 + 4 + 2 + PHY_PAYLOAD_SIZE + 3) * 4)
	#define GRID_TO_EVENT_OFFSET	GPI_TICK_US_TO_HYBRID(6 * 4 + 0)		// preamble + address + event signaling latency
	#define RX_DMA_TIMEOUT			GPI_TICK_US_TO_FAST2(((2 + PHY_PAYLOAD_SIZE + 3) * (8 + 1)) / 2)
										// = (2 + PHY_PAYLOAD_SIZE + 3) * (4 + 0.5) incl. +0.5 tolerance for clock drift
#elif (MX_PHY_MODE == MX_BLE_MODE_500k)
	#define PACKET_AIR_TIME			GPI_TICK_US_TO_HYBRID2(80 + 256 + 16 + 24 + ((((2 + PHY_PAYLOAD_SIZE + 3) * 8) + 3) * 2))
	#define GRID_TO_EVENT_OFFSET	GPI_TICK_US_TO_HYBRID(80 + 256 + 0)		// preamble + address + event signaling latency
	#define RX_DMA_TIMEOUT			GPI_TICK_US_TO_FAST2(16 + 24 + (2 + PHY_PAYLOAD_SIZE + 3) * (16 + 1))	// NOTE: +1 incl. tolerance for clock drift
#elif (MX_PHY_MODE == MX_BLE_MODE_125k)
	#define PACKET_AIR_TIME			GPI_TICK_US_TO_HYBRID2(80 + 256 + 16 + 24 + ((((2 + PHY_PAYLOAD_SIZE + 3) * 8) + 3) * 8))
	#define GRID_TO_EVENT_OFFSET	GPI_TICK_US_TO_HYBRID(80 + 256 + 0)		// preamble + address + event signaling latency
	#define RX_DMA_TIMEOUT			GPI_TICK_US_TO_FAST2(16 + 24 + (2 + PHY_PAYLOAD_SIZE + 3) * (64 + 1))	// NOTE: +1 incl. tolerance for clock drift
#else
	#error MX_PHY_MODE is invalid or unsupported
#endif

#define RX_TO_GRID_OFFSET			(0 + GPI_TICK_US_TO_HYBRID(40))			// software latency + RX ramp up time
#define TX_TO_GRID_OFFSET			(16 + GPI_TICK_US_TO_HYBRID(40))			// software latency + TX ramp up time

#define RX_WINDOW_INCREMENT			((3 * DRIFT_TOLERANCE) / 2)
	// factor 1.5 is important to widen the window in next slot (factor 1 would follow only)
#define RX_WINDOW_MIN				(2 * ((3 * DRIFT_TOLERANCE) + (2 * JITTER_TOLERANCE) + GPI_TICK_US_TO_HYBRID(5)))
	// minimum must cover DRIFT_TOLERANCE, JITTER_TOLERANCE, variations in RX ramp up time,
	// and variations in execution time from timer polling to RX on. The factor on DRIFT_TOLERANCE
	// accounts for additional uncertainties following from the control loop (i.e., tracking the grid).
	// JITTER_TOLERANCE can be effective peak-to-peak (e.g. TX delay at node A -> causes grid delay
	// at node B, + TX delay at node B -> 2x delay at node A)
#define RX_WINDOW_MAX				MIN(0x7FFFFFFF, MIN(RX_WINDOW_MIN + (20 * RX_WINDOW_INCREMENT), (MX_SLOT_LENGTH - PACKET_AIR_TIME - RX_TO_GRID_OFFSET - ISR_LATENCY_BUFFER) / 2))

// NOTE: choosing applicable RX_WINDOW_... settings can be critical if the network density is very low
// compared to the number of nodes (or the number of really existing nodes is far below MX_NUM_NODES).
// The ratio (RX_WINDOW_MAX - RX_WINDOW_MIN) / RX_WINDOW_INCREMENT determines the maximum number of slots
// without any reception before a node enters resync mode. Resync mode by itself is not critical, but
// if *all* nodes enter resync simultaneously it will destroy the round. So on one hand a node that indeed
// lost sync should not wait to long before entering resync, but on the other hand the waiting time should
// be not to short to keep the probability that all nodes enter resync simultaneously as low as possible.

