nes-lab/Butler/app/mixer/nrf52840/mixer_transport_ble.c
#define GRID_DRIFT_FILTER_DIV		4
#define GRID_TICK_UPDATE_DIV		2
#define GRID_DRIFT_MAX				MIN(((3 * DRIFT_TOLERANCE) + JITTER_TOLERANCE) * GRID_TICK_UPDATE_DIV * GRID_DRIFT_FILTER_DIV, 0x7FFFFF)
	// P control loop has a permanent deviation since control_value = drift / GRID_TICK_UPDATE_DIV
	// -> to be able to compensate for drift up to DRIFT_TOLERANCE, GRID_DRIFT_MAX must be > DRIFT_TOLERANCE * GRID_TICK_UPDATE_DIV
	// Additional to this, the control loop doesn't get an new measurement in every slot, so the single-value
	// measurement may exceed the theoretical limit. Therefore we add a margin factor.
#define TX_OFFSET_FILTER_DIV		8
#define TX_OFFSET_MAX				(MAX_PROPAGATION_DELAY + GPI_TICK_US_TO_HYBRID(2))

#define ISR_LATENCY_BUFFER			20		// in microseconds
	// influencing factors:
	// - interrupts locked on thread level
	// - interrupt latency for grid timer ISR
	// - rare number of exceedings is acceptable (can be measured with MX_VERBOSE_PROFILE and stat_counter.num_rx_late/num_tx_late)

// TODO: throws warnings even if it shouldn't
// ASSERT_CT_WARN_STATIC(((RX_WINDOW_MAX - RX_WINDOW_MIN) / RX_WINDOW_INCREMENT) >= 10, critical_RX_WINDOW_settings);

//**************************************************************************************************

#if   (0 == GPI_FAST_CLOCK_NRF_TIMER)
	#define MAIN_TIMER				NRF_TIMER0
	#define MAIN_TIMER_IRQ			TIMER0_IRQn
	#define MAIN_TIMER_ISR_NAME		TIMER0_IRQHandler
#elif (1 == GPI_FAST_CLOCK_NRF_TIMER)
	#define MAIN_TIMER				NRF_TIMER1
	#define MAIN_TIMER_IRQ			TIMER1_IRQn
	#define MAIN_TIMER_ISR_NAME		TIMER1_IRQHandler
#elif (2 == GPI_FAST_CLOCK_NRF_TIMER)
	#define MAIN_TIMER				NRF_TIMER2
	#define MAIN_TIMER_IRQ			TIMER2_IRQn
	#define MAIN_TIMER_ISR_NAME		TIMER2_IRQHandler
#elif (3 == GPI_FAST_CLOCK_NRF_TIMER)
	#define MAIN_TIMER				NRF_TIMER3
	#define MAIN_TIMER_IRQ			TIMER3_IRQn
	#define MAIN_TIMER_ISR_NAME		TIMER3_IRQHandler
#elif (4 == GPI_FAST_CLOCK_NRF_TIMER)
	#define MAIN_TIMER				NRF_TIMER4
	#define MAIN_TIMER_IRQ			TIMER4_IRQn
	#define MAIN_TIMER_ISR_NAME		TIMER4_IRQHandler
#else
	#error GPI_FAST_CLOCK_NRF_TIMER is invalid
#endif

#define MAIN_TIMER_CC_INDEX			3
#define MAIN_TIMER_CC_REG			(MAIN_TIMER->CC[MAIN_TIMER_CC_INDEX])
#define EVENT_CAPTURE_CC_INDEX		2
#define EVENT_CAPTURE_CC_REG		(MAIN_TIMER->CC[EVENT_CAPTURE_CC_INDEX])

#define NRF_PPI_CHANNEL				19	// timer <-> radio (start, SFD capture, ...)
#define NRF_PPI_CHANNEL_2			18	// ADDRESS -> Bitcounter

//**************************************************************************************************

#if MX_VERBOSE_STATISTICS
	#define LED_ISR(name, led)									\
		name ## _ ();											\
		void name() {											\
			if (gpi_wakeup_event) {								\
				mx.wake_up_timestamp = gpi_tick_fast_native();	\
				gpi_wakeup_event = 0;							\
			}													\
			gpi_led_toggle(led);								\
			name ## _ ();										\
			gpi_led_toggle(led);								\
		}														\
		void name ## _ ()
#else
	#define LED_ISR(name, led)									\
		name ## _ ();											\
		void name() {											\
			gpi_led_toggle(led);								\
			name ## _ ();										\
			gpi_led_toggle(led);								\
		}														\
		void name ## _ ()
#endif

//**************************************************************************************************
//***** Local Typedefs and Class Declarations ******************************************************

typedef enum Slot_State_tag
{
	RESYNC		= 0,
	RX_RUNNING	= 16,
	TX_RUNNING	= 12,
	IDLE		= 12,	// ATTENTION: TX and IDLE are not distinguished here

} Slot_State;

//**************************************************************************************************
//***** Forward Declarations ***********************************************************************

void	timeout_isr();
void	grid_timer_isr();

//**************************************************************************************************
//***** Local (Static) Variables *******************************************************************

static struct
{
	Gpi_Hybrid_Tick			event_tick_nominal;
	Gpi_Hybrid_Tick			next_grid_tick;
	Gpi_Hybrid_Tick			next_trigger_tick;
	int32_t					grid_drift;
	int32_t					grid_drift_cumulative;
	uint32_t				rx_trigger_offset;
	uint32_t				tx_trigger_offset;

	Packet					tx_fifo;

	Slot_State				slot_state;
	Slot_Activity			next_slot_task;

#if MX_VERBOSE_STATISTICS
	Gpi_Fast_Tick_Native	radio_start_timestamp;
#endif

} s;

//**************************************************************************************************
//***** Global Variables ***************************************************************************



//**************************************************************************************************
//***** Local Functions ****************************************************************************

// trigger grid/timeout timer (immediately)
static inline void trigger_main_timer(int use_int_lock)
{
	register int	tmp, ie;

	if (use_int_lock)
		ie = gpi_int_lock();

	// use asm to safeguard time-critical code
	// 		MAIN_TIMER->TASKS_CAPTURE[MAIN_TIMER_CC_INDEX] = 1;
	// 		MAIN_TIMER->CC[MAIN_TIMER_CC_INDEX] += 3;
	// ATTENTION: some callees rely on the fact that CC_REG gets updated implicitly
	// ATTENTION: Choosing the increment value is difficult due to missing details in the
	// documentation. We found that values < 8 can cause problems (missed events), while
	// values >= 8 seem to work reliable. We use 10 to have some safety margin.
	// NOTE: An alternative could be to trigger the IRQ via NVIC->STIR. Though, one has to
	// check if the masking/unmasking is consistent when implementing it this way.
	__asm__ volatile
	(
		"str	%0, [%1, %2]	\n"
		"ldr	%0, [%1, %3]	\n"
		"add	%0, #10			\n"
		"str	%0, [%1, %3]	\n"
		: "=&r"(tmp)
		: "r"(MAIN_TIMER),
			"i"(offsetof(typeof(*MAIN_TIMER), TASKS_CAPTURE[MAIN_TIMER_CC_INDEX])),
			"i"(offsetof(typeof(*MAIN_TIMER), CC[MAIN_TIMER_CC_INDEX])),
			"0"(1)
		: "memory"
	);

	if (use_int_lock)
		gpi_int_unlock(ie);

