nes-lab/Butler/app/mixer/nrf52840/mixer_transport_ble.c
// TODO: if helpful: wait until compare time has been reached
// TODO: remove intlock if not really needed (calls from thread-level are allowed only at defined points)
}

//**************************************************************************************************

static inline void unmask_main_timer(int clear_pending)
{
	if (clear_pending)
	{
		MAIN_TIMER->EVENTS_COMPARE[MAIN_TIMER_CC_INDEX] = 0;
		NVIC_ClearPendingIRQ(MAIN_TIMER_IRQ);
	}

	MAIN_TIMER->INTENSET = 0x10000 << MAIN_TIMER_CC_INDEX;
}

static inline void mask_main_timer()
{
	MAIN_TIMER->INTENCLR = 0x10000 << MAIN_TIMER_CC_INDEX;
}

//**************************************************************************************************

// ATTENTION: to be called from ISRs only
static inline __attribute__((always_inline)) void set_event(Event event)
{
	// ATTENTION: use API function to ensure that load/store exclusive works right (if used)
	gpi_atomic_set(&(mx.events), BV(event));
//	mx.events |= BV(event);
}

//**************************************************************************************************

static inline unsigned int write_tx_fifo(unsigned int pos, const void *p1, const void *p2, int size)
{
	uint32_t		*dest = (uint32_t*)((uint8_t*)&s.tx_fifo + pos);
	uint32_t		or_data = 0;
	register int	tmp1, tmp2;

	// NOTE: We do not assume that dest, p1, p2, or size is aligned because we want to support
	// unaligned values. Fortunately Cortex-M4 supports unaligned accesses (with corresponding
	// performance penalty), so we do not need to handle them explicitly.

	__asm__ volatile
	(
		".align 2				\n"
		"1:						\n"
		"orr.w	%3, %5			\n"
		"ldr.w	%5, [%1], #4	\n"
		"cmp.n	%2, #0			\n"
		"itt	ne				\n"
			// NOTE: cmp + itt seems more wasteful than it is because itt gets folded on cmp,
			// i.e. it executes in 0 cycles. Hence, cmp + itt is same/less expensive than cbz
			// (if branch not taken / taken).
		"ldrne	%6, [%2], #4	\n"
		"eorne	%5, %6			\n"
		"str	%5, [%0], #4	\n"
		"subs	%4, #4			\n"
		"bgt	1b				\n"

		// following instructions ensure that or_data is not influenced by padding bytes
		// in case size is unaligned
		"adds	%4, #4			\n"
		"lsl	%4, 3			\n"
		"mov	%6, #-1			\n"
		"lsl	%6, %4			\n"
		"bic	%5, %6			\n"
		"orr	%3, %5			\n"

		: "+&r"(dest), "+&r"(p1), "+&r"(p2), "+&r"(or_data), "+&r"(size), "=&r"(tmp1), "=&r"(tmp2)
		: "5"(0)
		: "cc", "memory"
	);

	// return value can be used to check if the data written to the FIFO was all-zeros
	return or_data;
}

//**************************************************************************************************

static void start_grid_timer()
{
	GPI_TRACE_FUNCTION_FAST();

#if GPI_HYBRID_CLOCK_USE_VHT
	// NOTE: MAX_TB_INTERVAL could be set to the largest possible value which can be covered by
	// fast clock. However, the time is based on hybrid clock, which means that the accuracy
	// decreases with longer (purely) fast clock intervals. So we choose a compromise.
	const Gpi_Hybrid_Tick	MAX_TB_INTERVAL = GPI_TICK_US_TO_HYBRID(500);
#endif

	Gpi_Hybrid_Reference	r;
	Gpi_Hybrid_Tick			d, t;

	r = gpi_tick_hybrid_reference();
	d = s.next_trigger_tick - r.hybrid_tick;

	t = s.next_trigger_tick - GPI_TICK_US_TO_HYBRID(ISR_LATENCY_BUFFER);
#if GPI_HYBRID_CLOCK_USE_VHT
	// cover potential execution time from getting r to writing capture reg
	t -= GPI_TICK_US_TO_HYBRID(1000000 / GPI_SLOW_CLOCK_RATE + 50);
	#error check value (GPI_HYBRID_CLOCK_USE_VHT is not fully implemented / tested)
#endif

//	GPI_TRACE_MSG_FAST(TRACE_VERBOSE, "d: %lu", (long)d);

	// if we are late
	if (gpi_tick_compare_hybrid(r.hybrid_tick, t) >= 0)
	{
		// trigger grid timer immediately
		// NOTE: capture register is updated implicitly
		trigger_main_timer(0);
		unmask_main_timer(0);
#if GPI_HYBRID_CLOCK_USE_VHT
		mask_slow_timer();
#endif

		#if MX_VERBOSE_STATISTICS
			mx.stat_counter.num_grid_late++;
		#endif
	}

	// else if trigger tick is in reach for fast timer
#if GPI_HYBRID_CLOCK_USE_VHT
	else if (d <= MAX_TB_INTERVAL)
#else
	else
#endif
	{
		MAIN_TIMER_CC_REG = r.fast_capture + (d * FAST_HYBRID_RATIO) - GPI_TICK_US_TO_FAST(ISR_LATENCY_BUFFER);
		unmask_main_timer(1);
#if GPI_HYBRID_CLOCK_USE_VHT
		mask_slow_timer();
#endif
	}

	// else if trigger tick is far away
#if GPI_HYBRID_CLOCK_USE_VHT
	else
	{
		#error GPI_HYBRID_CLOCK_USE_VHT is not implemented

/*		ASSERT_CT(HYBRID_SLOW_RATIO <= 0x10000);

		if (d > 0xF000ul * HYBRID_SLOW_RATIO)
			d = r.hybrid_tick + 0xE000ul * HYBRID_SLOW_RATIO;
		else d = s.next_trigger_tick - MAX_TB_INTERVAL / 2;

		SLOW_TIMER_CC_REG = d / HYBRID_SLOW_RATIO;
		unmask_slow_timer();

		// stop main timer
		// ATTENTION: since main timer is jointly used as grid and timeout timer, a caller to
		// start_grid_timer() may expect that main timer is reinitialized in every case. Hence,
		// we do it here for sure.
		mask_main_timer();
*/	}
#endif

	s.slot_state = (RESYNC == s.slot_state) ? RESYNC : IDLE;

	GPI_TRACE_RETURN_FAST();
}

//**************************************************************************************************
#if GPI_HYBRID_CLOCK_USE_VHT

#error GPI_HYBRID_CLOCK_USE_VHT is not implemented
/*
// helper ISR for grid timer, see start_grid_timer() for details
void ..._isr()
{
	mask_slow_timer();

	start_grid_timer();
}
*/
#endif
//**************************************************************************************************

// mode: 0 = RESYNC quick, 1 = RESYNC normal, 2 = start Tx (for initiator)
static inline __attribute__((always_inline)) void enter_resync(int mode)
{
	if (2 == mode)
	{
		// start Tx
		s.slot_state = IDLE;
		s.next_slot_task = TX;
	}
	else if (1 == mode)
	{
		// start Rx by activating RESYNC
		s.slot_state = RESYNC;
		s.next_slot_task = RX;
	}
	else if (STOP == s.next_slot_task)
	{
		// call grid timer ISR (and not timeout timer ISR)
		s.slot_state = IDLE;
	}
	else
	{
		// enter RESYNC
		s.slot_state = RESYNC;
		s.next_slot_task = RX;
	}

	// trigger grid timer immediately (with interrupt masked)
	// NOTE: MAIN_TIMER_CC_REG is updated implicitly
	trigger_main_timer(1);

	// if quick (and dirty): don't update s.next_grid_tick to save time
	// ATTENTION: this expects s.next_grid_tick to be initialized and causes the first RESYNC timeout
	// interval to be up to +/- MX_SLOT_LENGTH longer. Furthermore it saves a REORDER_BARRIER(), so
	// don't use quick with interrupts unlocked.
	if (0 != mode)
	{
		// init s.next_grid_tick to precise value
		// ATTENTION: this is important to align the initiator exactly at the grid
		// NOTE: MAIN_TIMER_CC_REG + buffer (see below) is the trigger tick. Grid timer ISR will
		// assume + ISR_LATENCY_BUFFER as polling interval. Hence,
		// grid tick = MAIN_TIMER_CC_REG + buffer + ISR_LATENCY_BUFFER + TX_TO_GRID_OFFSET.
		// NOTE: if mode == 1, the timing is not critical since we enter RESYNC mode
		s.next_grid_tick =
			gpi_tick_fast_to_hybrid(MAIN_TIMER_CC_REG) +
			GPI_TICK_US_TO_HYBRID(20) +
			GPI_TICK_US_TO_HYBRID(ISR_LATENCY_BUFFER) +
			TX_TO_GRID_OFFSET;

		// add some time buffer covering the remaining execution time from here until interrupt
		// gets unlocked
		// ATTENTION: don't do that before calling gpi_tick_fast_to_hybrid() because then
		// gpi_tick_fast_to_hybrid() would work on a future value.
		MAIN_TIMER_CC_REG += GPI_TICK_US_TO_FAST(20);

		REORDER_BARRIER();
		__DMB();
	}

