nes-lab/Butler/app/mixer/nrf52840/mixer_transport_ble.c
// don't include ASSERTS into naked function to avoid problems
// (in case non-optimized compilation generates code for them)
ASSERT_CT_STATIC(RESYNC     ==  0, definition_of_RESYNC_does_not_match_assembly_code);
ASSERT_CT_STATIC(RX_RUNNING == 16, definition_of_RX_RUNNING_does_not_match_assembly_code);
ASSERT_CT_STATIC(TX_RUNNING == 12, definition_of_TX_RUNNING_does_not_match_assembly_code);
ASSERT_CT_STATIC(IDLE       == 12, definition_of_IDLE_does_not_match_assembly_code);

//**************************************************************************************************

// timeout ISR
// triggered if there was no successful packet transfer in a specific time interval
void LED_ISR(timeout_isr, LED_TIMEOUT_ISR)
{
	GPI_TRACE_FUNCTION_FAST();
	PROFILE_ISR("timeout ISR entry");

	// NOTE: being here implies that Rx is active (state = RESYNC or RX_RUNNING)

	#if MX_VERBOSE_STATISTICS
		int frame_running =
				NRF_RADIO->EVENTS_ADDRESS &&
				BV_TEST_BY_VALUE(NRF_RADIO->INTENSET, RADIO_INTENSET_ADDRESS, 0);
	#endif

	// mask interrupts and events
	// NOTE: stopping timeout timer is not needed since this is done implicitely below
	NRF_RADIO->INTENCLR = -1u;
	NRF_PPI->CHENCLR = BV(NRF_PPI_CHANNEL) | BV(NRF_PPI_CHANNEL_2);

	// turn radio off
	if (!BV_TEST_BY_NAME(NRF_RADIO->STATE, RADIO_STATE_STATE, RxDisable))
		NRF_RADIO->TASKS_DISABLE = 1;

	// ATTENTION: it can take up to four clock cycles before INTENCLR from above becomes effective
	// (see ARM Cortex-M4 Generic User Guide). To avoid the need for an explicit delay before
	// clearing the core-internal pending state we just insert some code inbetween.
	NVIC_ClearPendingIRQ(RADIO_IRQn);

	gpi_led_off(LED_RX | LED_TX);

	#if MX_VERBOSE_STATISTICS
	if (s.radio_start_timestamp & 1)
	{
		mx.stat_counter.radio_on_time += gpi_tick_fast_native() - s.radio_start_timestamp;
		s.radio_start_timestamp = 0;
	}
	#endif

	if (s.slot_state != RESYNC)
	{
		// update stat counters only on real timeouts
		#if MX_VERBOSE_STATISTICS
			if (!frame_running)
				mx.stat_counter.num_rx_timeout++;
			else if (*(uint8_t*)(NRF_RADIO->PACKETPTR - offsetof(Packet, ble_header) +
					offsetof(Packet, len)) == PHY_PAYLOAD_SIZE)
				mx.stat_counter.num_rx_dma_timeout++;
		#endif

		// widen Rx time window
		s.rx_trigger_offset += RX_WINDOW_INCREMENT;

		// if Rx window exceeds limit: start RESYNC
		// NOTE: we start RESYNC immediately (instead of saturating) because we probably lost
		// synchronization and hence do not expect to receive something anymore
		if (s.rx_trigger_offset > RX_TO_GRID_OFFSET + RX_WINDOW_MAX)
		{
			#if MX_VERBOSE_STATISTICS
				mx.stat_counter.num_rx_window_overflow++;
				mx.stat_counter.num_resync++;
			#endif
			GPI_TRACE_MSG_FAST(TRACE_INFO, "Rx window overflow: %u > %u -> enter RESYNC",
				s.rx_trigger_offset, RX_TO_GRID_OFFSET + RX_WINDOW_MAX);

			enter_resync(0);
		}

		else
		{
			// update next trigger tick
			s.next_trigger_tick = s.next_grid_tick -
				((s.next_slot_task == TX) ? s.tx_trigger_offset : s.rx_trigger_offset);

			// handover to grid timer
			// NOTE: this is done automatically while RESYNC is running
			// (more precisely: if RESYNC was active before entering current function)
			start_grid_timer();
		}
	}

	PROFILE_ISR("timeout ISR return");
	GPI_TRACE_RETURN_FAST();
}

//**************************************************************************************************

// grid timer ISR
// this is one of the central transport layer routines
void LED_ISR(grid_timer_isr, LED_GRID_TIMER_ISR)
{
	GPI_TRACE_FUNCTION_FAST();
	PROFILE_ISR("grid timer ISR entry");

	mask_main_timer();

	// if STOP requested: stop
	if (STOP == s.next_slot_task)
	{
		#if MX_VERBOSE_STATISTICS
			mx.stat_counter.slot_off = mx.slot_number;	// the old one (viewpoint: turn off after last processing)
		#endif

		set_event(STOPPED);
		GPI_TRACE_MSG_FAST(TRACE_INFO, "transport layer stopped");

		GPI_TRACE_RETURN_FAST();
	}

	// if Rx
	if ((RESYNC == s.slot_state) || (RX == s.next_slot_task))
	{
		PROFILE_ISR("grid timer ISR start Rx begin");

		Gpi_Hybrid_Reference	r;
		Gpi_Fast_Tick_Native 	trigger_tick;
		int_fast8_t				late = 1;
		volatile Packet			*packet;

		// compute exact trigger time
		trigger_tick = MAIN_TIMER_CC_REG + GPI_TICK_US_TO_FAST(ISR_LATENCY_BUFFER);

		if (RESYNC != s.slot_state)
		{
			// arm timer for exact trigger time
			MAIN_TIMER_CC_REG = trigger_tick;
			MAIN_TIMER->EVENTS_COMPARE[MAIN_TIMER_CC_INDEX] = 0;

			// connect TIMER->TASKS_COMPARE to RADIO->RXEN (via PPI)
			NRF_PPI->CH[NRF_PPI_CHANNEL].EEP =
				(uintptr_t)&(MAIN_TIMER->EVENTS_COMPARE[MAIN_TIMER_CC_INDEX]);
			NRF_PPI->CH[NRF_PPI_CHANNEL].TEP =
				(uintptr_t)&(NRF_RADIO->TASKS_RXEN);
			NRF_PPI->CHENSET = BV(NRF_PPI_CHANNEL);

			// wait until trigger time has been reached
			PROFILE_ISR();

			while (gpi_tick_compare_fast_native(gpi_tick_fast_native(), trigger_tick) < 0)
				late = 0;

			PROFILE_ISR();

			// test if start was successful
			// NOTE: avoids race condition if trigger tick is reached short before the polling loop
			if (BV_TEST_BY_NAME(NRF_RADIO->STATE, RADIO_STATE_STATE, RxRu))
				late = 0;

			// disable PPI channel
			NRF_PPI->CHENCLR = BV(NRF_PPI_CHANNEL);

			#if MX_VERBOSE_STATISTICS
				if (late)
					mx.stat_counter.num_rx_late++;
			#endif
		}

		// during RESYNC or if we are late: start manually (immediately)
		if (late)
		{
			NRF_RADIO->TASKS_RXEN = 1;

			#if MX_VERBOSE_STATISTICS
				trigger_tick = gpi_tick_fast_native();
			#endif
		}

		#if MX_VERBOSE_STATISTICS
			s.radio_start_timestamp = trigger_tick | 1;
		#endif

		// connect RADIO->EVENTS_ADDRESS to TIMER->TASKS_CAPTURE (via PPI)
		NRF_PPI->CH[NRF_PPI_CHANNEL].EEP =
			(uintptr_t)&(NRF_RADIO->EVENTS_ADDRESS);
		NRF_PPI->CH[NRF_PPI_CHANNEL].TEP =
			(uintptr_t)&(MAIN_TIMER->TASKS_CAPTURE[EVENT_CAPTURE_CC_INDEX]);
		NRF_PPI->CHENSET = BV(NRF_PPI_CHANNEL);

		// allocate rx queue destination slot
		packet = &mx.rx_queue[mx.rx_queue_num_written % NUM_ELEMENTS(mx.rx_queue)];
		NRF_RADIO->PACKETPTR = (uintptr_t)&(packet->ble_header);
		mx.rx_queue_num_writing = mx.rx_queue_num_written + 1;

