nes-lab/Butler/app/mixer/nrf52840/mixer_transport_ble.c
		// enable Bitcounter to monitor frame length
		NRF_PPI->CHENSET = BV(NRF_PPI_CHANNEL_2);

		// set LEN = 0 (see timeout ISR for details)
		packet->len = 0;

		NRF_RADIO->EVENTS_ADDRESS = 0;
		NRF_RADIO->EVENTS_END = 0;
		NRF_RADIO->EVENTS_BCMATCH = 0;
//		NVIC_ClearPendingIRQ(RADIO_IRQn);

		// unmask IRQs
		NRF_RADIO->INTENSET =
			BV_BY_VALUE(RADIO_INTENSET_ADDRESS, 1) |
			BV_BY_VALUE(RADIO_INTENSET_END, 1) |
			BV_BY_VALUE(RADIO_INTENSET_BCMATCH, 1);

		s.event_tick_nominal = s.next_grid_tick + GRID_TO_EVENT_OFFSET;

		r = gpi_tick_hybrid_reference();

		// if RESYNC: restart grid timer (-> potentially long interval)
		// NOTE: timeout timer is called implicitly while RESYNC
		if (s.slot_state == RESYNC)
		{
			// ATTENTION: don't do s.next_grid_tick += MX_SLOT_LENGTH_RESYNC because grid timer is also
			// triggered by frames from interferers (Rx -> SFD -> ... (broken/invalid) -> timeout
			// -> grid timer) and hence current time might be far away from s.next_grid_tick. With
			// s.next_grid_tick += MX_SLOT_LENGTH_RESYNC, s.next_grid_tick could end up in the far
			// future if it gets incremented frequently.
			s.next_grid_tick = r.hybrid_tick + MX_SLOT_LENGTH_RESYNC;
			s.next_trigger_tick = s.next_grid_tick;
			start_grid_timer();
		}

		// else start timeout timer
		else
		{
			Gpi_Hybrid_Tick		t;

			// timeout point = grid tick + GRID_TO_EVENT_OFFSET + window, window = trigger offset - RX_TO_GRID_OFFSET
			t = s.next_grid_tick + s.rx_trigger_offset - RX_TO_GRID_OFFSET + GRID_TO_EVENT_OFFSET;

			MAIN_TIMER_CC_REG = r.fast_capture + (t - r.hybrid_tick) * FAST_HYBRID_RATIO;
			unmask_main_timer(1);

			s.slot_state = RX_RUNNING;

			GPI_TRACE_MSG_FAST(TRACE_VERBOSE, "timeout: %lu", (long)gpi_tick_hybrid_to_us(t));
		}

		PROFILE_ISR("grid timer ISR start Rx end");
		GPI_TRACE_MSG_FAST(TRACE_INFO, "Rx started");
	}

	// if Tx
	else
	{
		PROFILE_ISR("grid timer ISR start Tx begin");

		ASSERT_CT(!((uintptr_t)&mx.tx_packet % sizeof(uint_fast_t)), alignment_issue);
		ASSERT_CT(!((uintptr_t)&s.tx_fifo % sizeof(uint_fast_t)), alignment_issue);

		Gpi_Fast_Tick_Native 	trigger_tick;
		int_fast8_t				late = 1;
		uint8_t					*p;

		// compute exact trigger time
		trigger_tick = MAIN_TIMER_CC_REG + GPI_TICK_US_TO_FAST(ISR_LATENCY_BUFFER);

		// arm timer for exact trigger time
		MAIN_TIMER_CC_REG = trigger_tick;
		MAIN_TIMER->EVENTS_COMPARE[MAIN_TIMER_CC_INDEX] = 0;

		// connect TIMER->TASKS_COMPARE to RADIO->TXEN (via PPI)
		NRF_PPI->CH[NRF_PPI_CHANNEL].EEP =
			(uintptr_t)&(MAIN_TIMER->EVENTS_COMPARE[MAIN_TIMER_CC_INDEX]);
		NRF_PPI->CH[NRF_PPI_CHANNEL].TEP =
			(uintptr_t)&(NRF_RADIO->TASKS_TXEN);
		NRF_PPI->CHENSET = BV(NRF_PPI_CHANNEL);

		// wait until trigger time has been reached
		PROFILE_ISR();

		while (gpi_tick_compare_fast_native(gpi_tick_fast_native(), trigger_tick) < 0)
			late = 0;

		PROFILE_ISR();

		// test if start was successful
		// NOTE: avoids race condition if trigger tick is reached short before the polling loop
		if (BV_TEST_BY_NAME(NRF_RADIO->STATE, RADIO_STATE_STATE, TxRu))
			late = 0;

		// disable PPI channel
		NRF_PPI->CHENCLR = BV(NRF_PPI_CHANNEL);

		// if we are late: start manually (immediately)
		if (late)
		{
			NRF_RADIO->TASKS_TXEN = 1;

			#if MX_VERBOSE_STATISTICS
				trigger_tick = gpi_tick_fast_native();
			#endif
		}

		// init DMA
		// ATTENTION: must be done before START task gets triggered (via shortcut)
		// NOTE: while a delay in the following steps "only" damages the transmitted data,
		// a wrong PACKETPTR can crash the system (via HardFault exception)
		NRF_RADIO->PACKETPTR = (uintptr_t)&s.tx_fifo.ble_header;
		s.tx_fifo.len = PHY_PAYLOAD_SIZE;
		REORDER_BARRIER();

		PROFILE_ISR();

		gpi_led_on(LED_TX);

		#if MX_VERBOSE_STATISTICS
			s.radio_start_timestamp = trigger_tick | 1;
			if (late)
				mx.stat_counter.num_tx_late++;
		#endif

		// finalize header
		{
			uint16_t slot_number = mx.slot_number + 1;

			mx.tx_packet.slot_number = slot_number;
			mx.tx_packet.flags.all = 0;
			#if MX_REQUEST
				ASSERT_CT(IT_ROW_MAP == 0);
			#else
				mx.tx_packet.flags.info_type = IT_UNDEFINED;
			#endif

			#if (MX_COORDINATED_TX && !MX_BENCHMARK_NO_COORDINATED_STARTUP)
				if (slot_number < MX_GENERATION_SIZE)
				{
					// NOTE: mx.matrix[slot_number] points to the msg "belonging" to the next slot (slot_number + 1) but the matrix index starts at 0
					if (0 == mx.matrix[slot_number].birth_slot)
						mx.tx_packet.flags.owner_forecast_1 = 1;

					if (slot_number + 1 < MX_GENERATION_SIZE)
						if (0 == mx.matrix[slot_number + 1].birth_slot)
							mx.tx_packet.flags.owner_forecast_2 = 1;
				}
			#endif

			if (MX_GENERATION_SIZE == mx.rank)
			{
				mx.tx_packet.flags.is_full_rank = 1;
				mx.tx_packet.flags.info_type = IT_FULL_RANK_MAP;

				#if MX_SMART_SHUTDOWN
					#if (MX_SMART_SHUTDOWN_MODE >= 3)
						if (mx.full_rank_state >= 1)
						{
							if (mx.is_shutdown_approved)
								mx.tx_packet.flags.info_type = IT_FULL_RANK_ACK_MAP_RADIO_OFF;
							else mx.tx_packet.flags.info_type = IT_FULL_RANK_ACK_MAP;
						}
						else
					#endif
					if (mx.is_shutdown_approved)
						mx.tx_packet.flags.info_type = IT_FULL_RANK_MAP_RADIO_OFF;
				#endif
			}

			#if MX_REQUEST
			else /*if (slot_number >= MX_GENERATION_SIZE)*/
			{
				// NOTE: Index to LUT1 is "missing ranks to full rank". Resulting value
				// basically says how much slots to wait after the last innovative packet
				// before sending a new request.
				// The first entry is never used because this would imply the node has full
				// rank and would have used the other if branch.

				// f(x) = (1 - 2 ^ (-0.2 * x)) / (1 - 2 ^ (-0.2))
				static const uint8_t LUT1[] =
				{
					 0,  1,  2,  3,  3,  4,  4,  5,  5,  6,
					 6,  6,  6,  6,  7,  7,  7,  7,  7,  7,
					 7,  7,  7,  7,  7,  7,  8
				};

				// TODO: evaluate best request LUT
				// static const uint8_t LUT1[] =
				// {
				//	 0,  3,  6,  9,  9,  12,  12,  15,  15,  18,
				//	 18,  18,  18,  18,  21,  21,  21,  21,  21,  21,
				//	 21,  21,  21,  21,  21,  21,  24
				// };

