nes-lab/Butler/app/mixer/nrf52840/mixer_transport_ble.c
				#if MX_VERBOSE_PACKETS || MX_REQUEST
					// mark the packet as broken since it could be possible that we interrupt
					// prepare_tx_packet() right now, hence writing data may damage the packet
					mx.tx_packet.is_valid = 0;
				#endif
			}

			else
			{
				#if MX_BENCHMARK_NO_SIDELOAD
					ps = NULL;
				#endif

				// following flag could be used to prohibit sideload dynamically
				// if (!mx.tx_packet.use_sideload)
				//	ps = NULL;

				// write coding vector with sideload and test if result is a zero packet;
				// if so: abort (below)
				// NOTE: another option might be to write some other useful information into the
				// packet instead of dropping it
				// NOTE: It would be a bit more precise to (1) write (only) the coding vector,
				// (2) test if zero, (3) write payload only if test is non-zero. However, we
				// write the full chunk at once to gain better performance in the typical case
				// (that is non-zero coding vector). Processing the full chunk at once not only
				// saves the second call, it also keeps the alignment(!). We expect that this way
				// is more efficient with relatively moderate packet sizes as in IEEE 802.15.4.
				if (!write_tx_fifo(offsetof(Packet, coding_vector), p, ps, CHUNK_SIZE))
					p = NULL;
			}

//			GPI_TRACE_MSG_FAST(TRACE_VERBOSE,
//				"is_ready: %u, mx.tx_sideload: %p, ps: %p, mx.req.help_index: %d",
//				(int)mx.tx_packet.is_ready, mx.tx_sideload, ps, (int)mx.request.help_index);
//			GPI_TRACE_MSG_FAST(TRACE_VERBOSE,
//				"matrix: %p...%p, rx_queue: %p...%p",
//				&mx.matrix, &mx.matrix[NUM_ELEMENTS(mx.matrix)],
//				&mx.rx_queue, &mx.rx_queue[NUM_ELEMENTS(mx.rx_queue)]);
		}

		// write info vector
		#if MX_INCLUDE_INFO_VECTOR
		if (NULL != p)
		{
			ASSERT_CT(offsetof(Packet, info_vector) ==
				offsetof(Packet, payload) + sizeof(mx.tx_packet.payload),
				inconsistent_program);

			void *ps;

			switch (mx.tx_packet.flags.all & EIT_mask)
			{
				#if MX_REQUEST
					case EIT_ROW_MAP:
					case EIT_ROW_REQUEST:
						ps = &mx.request.my_row_mask[0];
						break;
					case EIT_COLUMN_REQUEST:
						ps = &mx.request.my_column_mask[0];
						break;
				#endif

				#if MX_SMART_SHUTDOWN_MAP
					case EIT_FULL_RANK_MAP:
					case EIT_FULL_RANK_MAP_RADIO_OFF:
					case EIT_FULL_RANK_ACK_MAP:
					case EIT_FULL_RANK_ACK_MAP_RADIO_OFF:
						ps = &mx.full_rank_map.hash[0];
						break;
				#endif

				default: switch (mx.tx_packet.flags.info_type)
				{

				#if MX_WEAK_ZEROS
					case IT_WEAK_ZERO_MAP:
						ps = &mx.weak_zero_map.weak_mask[0];
						break;
				#endif

					case IT_UNDEFINED:
						// use arbitrary but aligned data
						ps = &mx.tx_packet.coding_vector;
						break;

					default:
						assert(0);
						ps = &mx.tx_packet.coding_vector;
						break;
				}
			}

			write_tx_fifo(offsetof(Packet, info_vector), ps, NULL, sizeof(mx.tx_packet.info_vector));
		}
		#endif

		// if zero packet: abort transmission
		if (NULL == p)
		{
			NRF_RADIO->TASKS_DISABLE = 1;
			gpi_led_off(LED_TX);

			#if MX_VERBOSE_STATISTICS
				mx.stat_counter.radio_on_time += gpi_tick_fast_native() - s.radio_start_timestamp;
				s.radio_start_timestamp = 0;
				mx.stat_counter.num_tx_zero_packet++;
			#endif

			GPI_TRACE_MSG_FAST(TRACE_INFO, "sideload produced zero-packet -> Tx aborted");
		}

		else
		{
			// unmask IRQ
			NRF_RADIO->EVENTS_END = 0;
//			NVIC_ClearPendingIRQ(RADIO_IRQn);
			NRF_RADIO->INTENSET = BV_BY_VALUE(RADIO_INTENSET_END, 1);

			// update mx.tx_packet to enable evaluation on processing layer
			// NOTE: not all fields are needed for MX_REQUEST,
			// particularly payload could be dropped (e.g. if time is critical)
			#if (MX_VERBOSE_PACKETS || MX_REQUEST)
				gpi_memcpy_dma_aligned(&mx.tx_packet, &s.tx_fifo, sizeof(Packet));
			#endif

			set_event(TX_READY);
			mx.stat_counter.num_sent++;

			GPI_TRACE_MSG_FAST(TRACE_INFO, "Tx started at %u",
				(unsigned int)gpi_tick_hybrid_to_us(gpi_tick_fast_to_hybrid(trigger_tick)));
		}

		s.slot_state = TX_RUNNING;
		mx.tx_packet.is_ready = 0;
		mx.tx_sideload = NULL;
		s.next_slot_task = RX;

		PROFILE_ISR("grid timer ISR start Tx end");
	}

	if (RESYNC != s.slot_state)
	{
		mx.slot_number++;
		set_event(SLOT_UPDATE);

		s.next_grid_tick += MX_SLOT_LENGTH + s.grid_drift / (GRID_DRIFT_FILTER_DIV * GRID_TICK_UPDATE_DIV);

		s.next_trigger_tick = s.next_grid_tick -
			((s.next_slot_task == TX) ? s.tx_trigger_offset : s.rx_trigger_offset);

		if (TX_RUNNING == s.slot_state)
			start_grid_timer();
	}

	GPI_TRACE_MSG_FAST(TRACE_VERBOSE, "slot_state: %d, next_grid: %lu, rx_offset: %u",
		s.slot_state, (unsigned long)gpi_tick_hybrid_to_us(s.next_grid_tick),
		(unsigned int)gpi_tick_hybrid_to_us(s.rx_trigger_offset));

	// set general purpose trigger event
	// compared to SLOT_UPDATE, TRIGGER_TICK is generated also during RESYNC periods (once
	// in a while). It can be used for maintenance tasks that are less time critical.
	set_event(TRIGGER_TICK);

	PROFILE_ISR("grid timer ISR return");
	GPI_TRACE_RETURN_FAST();
}

//**************************************************************************************************
//***** Global Functions ***************************************************************************

void mixer_transport_init()
{
	GPI_TRACE_FUNCTION();

	assert(MX_PHY_MODE == gpi_radio_get_mode());

	// connect shortcuts
	// NOTE: alternatively, Tx START could be triggered from timer via PPI
	// -> replace READY_START by RXREADY_START in this case
	NRF_RADIO->SHORTS =
		BV_BY_NAME(RADIO_SHORTS_READY_START, Enabled) |
		BV_BY_NAME(RADIO_SHORTS_END_DISABLE, Enabled) |
		BV_BY_NAME(RADIO_SHORTS_ADDRESS_BCSTART, Enabled);

	// set MAXLEN to avoid Rx buffer overflows
	NRF_RADIO->PCNF1 =
		(NRF_RADIO->PCNF1 & ~RADIO_PCNF1_MAXLEN_Msk) |
		BV_BY_VALUE(RADIO_PCNF1_MAXLEN, PHY_PAYLOAD_SIZE);

	// init Bitcounter to monitor frame length and
	// connect RADIO->EVENTS_BCMATCH to RADIO->TASKS_DISABLE (via PPI)
	// NOTE: We use the Bitcounter in addition to MAXLEN because MAXLEN stops just the DMA transfer,
	// not the whole radio (4413_417 v1.0 page 304). We want to stop the whole radio to safe energy.
	// NOTE: init Bitcounter such that it triggers when LEN > (not >=) nominal length
	NRF_RADIO->BCC = (2 + PHY_PAYLOAD_SIZE + 3) * 8 + 1;
#if ((MX_PHY_MODE == MX_BLE_MODE_125k) || (MX_PHY_MODE == MX_BLE_MODE_500k))
	NRF_RADIO->BCC += 5;	// CI + TERM1
#endif
	NRF_PPI->CH[NRF_PPI_CHANNEL_2].EEP = (uintptr_t)&(NRF_RADIO->EVENTS_BCMATCH);
	NRF_PPI->CH[NRF_PPI_CHANNEL_2].TEP = (uintptr_t)&(NRF_RADIO->TASKS_DISABLE);

	// arm main timer IRQ
	// TODO: main timer could have an ISR outside Mixer -> connect to that's dispatcher if present
	MAIN_TIMER->INTENCLR = -1u;
	NVIC_SetPriority(MAIN_TIMER_IRQ, 0);
	NVIC_ClearPendingIRQ(MAIN_TIMER_IRQ);
	NVIC_EnableIRQ(MAIN_TIMER_IRQ);

	// arm radio IRQ
	NRF_RADIO->INTENCLR = -1u;
	NVIC_SetPriority(RADIO_IRQn, 0);
	NVIC_ClearPendingIRQ(RADIO_IRQn);
	NVIC_EnableIRQ(RADIO_IRQn);

